TexasInstruments/mcupsdk-core/test/drivers/ipc_rpmsg/ipc_rpmsg_test_am263x/test_ipc_rpmsg.c
    /* send with NULL data */
    status = RPMessage_send(NULL, sizeof(msgObj), CSL_CORE_ID_R5FSS0_1,
                    gServerEndPt, gAckEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);

    /* send with zero size data  */
    status = RPMessage_send(&msgObj, 0, CSL_CORE_ID_R5FSS0_1,
                    gServerEndPt, gAckEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);

    /* send to end pt that is not created on remote,
       this is allowed, recevied message is dropped */
    status = RPMessage_send(&msgObj, sizeof(msgObj), CSL_CORE_ID_R5FSS0_1,
                    gNullEndPt, gAckEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);
    /* set reply to end pt that is not created on local,
       this is allowed, ack message is dropped */
    status = RPMessage_send(&msgObj, sizeof(msgObj), CSL_CORE_ID_R5FSS0_1,
                    gServerEndPt, gNullEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);

    /* send back to back messages without waiting, there should be timeout conditon
       due to queue full many times
     */
    fifoFullCount = 0;
    msgCount = 1000;
    for(msg=0; msg<msgCount; msg++)
    {
        status = RPMessage_send(&msgObj, sizeof(msgObj), CSL_CORE_ID_R5FSS0_1,
                        gServerEndPt, gAckEndPt, SystemP_NO_WAIT);
         ClockP_usleep(10);
        if(status == SystemP_TIMEOUT)
        {
            fifoFullCount++;
        }
    }
    /* send one message waiting for space in FIFO just to check a success case after failure */
    status = RPMessage_send(&msgObj, sizeof(msgObj), CSL_CORE_ID_R5FSS0_1,
                        gServerEndPt, gAckEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);

    DebugP_log("[TEST IPC RPMSG] Messages sent = %d \r\n", msgCount);
    DebugP_log("[TEST IPC RPMSG] FIFO Full count = %d \r\n", fifoFullCount);

    TEST_ASSERT_GREATER_OR_EQUAL_UINT32(0, fifoFullCount);

    /* use recv API on a end point which is created in handler mode */
    status = RPMessage_recv(&gAckMsgObject, &msgObj, &msgSize, &remoteCoreId, &remoteEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);

    /* recv error checks, first create rpmsg object */
    RPMessage_CreateParams_init(&rpmsgPrm);
    rpmsgPrm.localEndPt = gNullEndPt;
    status = RPMessage_construct(&gNullRpmsgObj, &rpmsgPrm);
    TEST_ASSERT_EQUAL_INT32(SystemP_SUCCESS, status);

    /* parameter checks */
    status = RPMessage_recv(&gNullRpmsgObj, NULL, &msgSize, &remoteCoreId, &remoteEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);
    status = RPMessage_recv(&gNullRpmsgObj, &msgObj, NULL, &remoteCoreId, &remoteEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);
    status = RPMessage_recv(&gNullRpmsgObj, &msgObj, &msgSize, NULL, &remoteEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);
    status = RPMessage_recv(&gNullRpmsgObj, &msgObj, &msgSize, &remoteCoreId, NULL, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_FAILURE, status);
    /* timeout check */
    status = RPMessage_recv(&gNullRpmsgObj, &msgObj, &msgSize, &remoteCoreId, &remoteEndPt, 10);
    TEST_ASSERT_EQUAL_INT32(SystemP_TIMEOUT, status);
    status = RPMessage_recv(&gNullRpmsgObj, &msgObj, &msgSize, &remoteCoreId, &remoteEndPt, 0);
    TEST_ASSERT_EQUAL_INT32(SystemP_TIMEOUT, status);

    /* unblock test, post unblock and then waitforever, it should return with a timeout status */
    RPMessage_unblock(&gNullRpmsgObj);
    status = RPMessage_recv(&gNullRpmsgObj, &msgObj, &msgSize, &remoteCoreId, &remoteEndPt, SystemP_WAIT_FOREVER);
    TEST_ASSERT_EQUAL_INT32(SystemP_TIMEOUT, status);

    /* cleanup */
    RPMessage_destruct(&gNullRpmsgObj);

    DebugP_logZoneRestore(oldDebugLogZone);
}

/* This code executes on remote core, i.e not on main core */
void test_ipc_remote_core_start()
{
    UNITY_BEGIN();

    /* announce endpt to main core, this is need for annouce test */
    RPMessage_announce(gMainCoreId, RPMessage_getLocalEndPt(&gServerMsgObject), SERVER_NAME);

    /* Run any to any test */
    test_rpmsgAnyToAny(NULL);

    /* wait for ever, now onwards main core will initaite all requests
     * to the server task, which will simply echo the messages
     */
    ClockP_sleep(SystemP_WAIT_FOREVER);

    UNITY_END();
}

/* This code executes on main core, i.e not on remote core */
void test_ipc_main_core_start()
{
    uint32_t i;

    Test_Args testArgs;

    UNITY_BEGIN();

    /* These MUST be the first tests to run */
    RUN_TEST(test_rpmsgControlEndPt, 296, NULL);
    RUN_TEST(test_rpmsgAnyToAny, 297, NULL);

    /* now you can comment tests if needed to debug a specific test */
    testArgs.echoMsgCount = 1000; /* this value is used by all later tests */
    /* performance test with minimum payload size */
    testArgs.msgSize = 4;
    testArgs.remoteCoreId = CSL_CORE_ID_R5FSS0_1;
    RUN_TEST(test_rpmsgOneToOne, 298, &testArgs);

    #if defined(SOC_AM64X) || defined(SOC_AM243X) || defined(SOC_AM263X)
    testArgs.remoteCoreId = CSL_CORE_ID_R5FSS1_0;
    RUN_TEST(test_rpmsgOneToOne, 300, &testArgs);
    testArgs.remoteCoreId = CSL_CORE_ID_R5FSS1_1;
    RUN_TEST(test_rpmsgOneToOne, 301, &testArgs);
    #endif

    #if defined(SOC_AM64X) || defined(SOC_AM243X)
    testArgs.remoteCoreId = CSL_CORE_ID_M4FSS0_0;
    RUN_TEST(test_rpmsgOneToOne, 1819, &testArgs);
    #endif

    #if defined(SOC_AM64X)
    testArgs.remoteCoreId = CSL_CORE_ID_A53SS0_0;
    RUN_TEST(test_rpmsgOneToOne, 1870, &testArgs);
    #endif

    #if defined(SOC_AM273X) || defined(SOC_AWR294X)
    testArgs.remoteCoreId = CSL_CORE_ID_C66SS0;
    RUN_TEST(test_rpmsgOneToOne, 300, &testArgs);
    #endif

    /* performance test with varying payload size */
    testArgs.remoteCoreId = CSL_CORE_ID_R5FSS0_1;
    testArgs.msgSize = 32;
    RUN_TEST(test_rpmsgOneToOne, 302, &testArgs);
    testArgs.remoteCoreId = CSL_CORE_ID_R5FSS0_1;
    testArgs.msgSize = 64;
    RUN_TEST(test_rpmsgOneToOne, 303, &testArgs);
    testArgs.remoteCoreId = CSL_CORE_ID_R5FSS0_1;
    testArgs.msgSize = 112;
    RUN_TEST(test_rpmsgOneToOne, 304, &testArgs);

