TexasInstruments/mcupsdk-core/test/drivers/ipc_rpmsg/ipc_rpmsg_test_am263x/test_ipc_rpmsg.c
    #if defined(SOC_AM64X) || defined(SOC_AM243X)
    /* performance test with varying payload size */
    testArgs.remoteCoreId = CSL_CORE_ID_M4FSS0_0;
    testArgs.msgSize = 32;
    RUN_TEST(test_rpmsgOneToOne, 1820, &testArgs);
    testArgs.remoteCoreId = CSL_CORE_ID_M4FSS0_0;
    testArgs.msgSize = 64;
    RUN_TEST(test_rpmsgOneToOne, 1821, &testArgs);
    testArgs.remoteCoreId = CSL_CORE_ID_M4FSS0_0;
    testArgs.msgSize = 112;
    RUN_TEST(test_rpmsgOneToOne, 1822, &testArgs);
    #endif

    #if defined(SOC_AM64X)
    /* performance test with varying payload size */
    testArgs.remoteCoreId = CSL_CORE_ID_A53SS0_0;
    testArgs.msgSize = 32;
    RUN_TEST(test_rpmsgOneToOne, 1871, &testArgs);
    testArgs.remoteCoreId = CSL_CORE_ID_A53SS0_0;
    testArgs.msgSize = 64;
    RUN_TEST(test_rpmsgOneToOne, 1872, &testArgs);
    testArgs.remoteCoreId = CSL_CORE_ID_A53SS0_0;
    testArgs.msgSize = 112;
    RUN_TEST(test_rpmsgOneToOne, 1873, &testArgs);
    #endif

    /* back to back message send and handler mode rx tests */
    testArgs.remoteCoreId = CSL_CORE_ID_R5FSS0_1;
    testArgs.msgSize = 4;
    RUN_TEST(test_rpmsgOneToOneBackToBack, 305, &testArgs);

    #if defined(SOC_AM64X) || defined(SOC_AM243X)
    /* back to back message send and handler mode rx tests */
    testArgs.remoteCoreId = CSL_CORE_ID_M4FSS0_0;
    testArgs.msgSize = 4;
    RUN_TEST(test_rpmsgOneToOneBackToBack, 1823, &testArgs);
    #endif

    #if defined(SOC_AM64X)
    /* back to back message send and handler mode rx tests */
    testArgs.remoteCoreId = CSL_CORE_ID_A53SS0_0;
    testArgs.msgSize = 4;
    RUN_TEST(test_rpmsgOneToOneBackToBack, 1874, &testArgs);
    #endif

    /* rx notify callback tests */
    testArgs.remoteCoreId = CSL_CORE_ID_R5FSS0_1;
    testArgs.msgSize = 4;
    testArgs.echoMsgCount = 1000;
    RUN_TEST(test_rpmsgRxNotifyCallback, 909, &testArgs);

    /* error condition checks */
    RUN_TEST(test_rpmsgErrorChecks, 306, NULL);

    /* Print performance numbers. */
    DebugP_log("\n[TEST IPC RPMSG] Performance Numbers Print Start\r\n\n");
    DebugP_log("- %u messages are sent and average one way message latency is measured\r\n\n", gMsgEchoCount);
    DebugP_log("Local Core  | Remote Core | Message Size | Average Message Latency (us)\r\n");
    DebugP_log("------------|-------------|--------------|------------------------------\r\n");
    for (i=0; i<gIpcPerfCnt; i++) {
        DebugP_log(" %s\t| %s\t| %d\t| %5.3f\r\n", SOC_getCoreName(gMainCoreId), SOC_getCoreName(gIpcPerfObj[i].remoteCoreId),
            gIpcPerfObj[i].msgSize,
            ((float)(gIpcPerfObj[i].msgLatency*1000/(gMsgEchoCount*2))/1000));
    }
    DebugP_log("\n[TEST IPC RPMSG] Performance Numbers Print End\r\n\n");

    /* delete objects test, this MUST be the last test */
    test_rpmsgDestructObjects();

    UNITY_END();
}

void test_main(void *args)
{
    Drivers_open();

    test_rpmsgCreateObjects();
    if(IpcNotify_getSelfCoreId()==gMainCoreId)
    {
        test_ipc_main_core_start();
    }
    else
    {
        test_ipc_remote_core_start();
    }

    Drivers_close();

    test_pos_main(NULL);
	test_neg_main(NULL);
}

void setUp(void)
{
}

void tearDown(void)
{
}
